/* automatically generated by rust-bindgen 0.69.1 */

pub const CBOR_CBOR_Case_Int64: u32 = 0;
pub const CBOR_CBOR_Case_String: u32 = 1;
pub const CBOR_CBOR_Case_Tagged: u32 = 2;
pub const CBOR_CBOR_Case_Array: u32 = 3;
pub const CBOR_CBOR_Case_Map: u32 = 4;
pub const CBOR_CBOR_Case_Simple_value: u32 = 5;
pub const CBOR_CBOR_Case_Serialized: u32 = 6;
pub const CBOR_MAJOR_TYPE_SIMPLE_VALUE: u32 = 7;
pub const CBOR_MAJOR_TYPE_UINT64: u32 = 0;
pub const CBOR_MAJOR_TYPE_NEG_INT64: u32 = 1;
pub const CBOR_MAJOR_TYPE_BYTE_STRING: u32 = 2;
pub const CBOR_MAJOR_TYPE_TEXT_STRING: u32 = 3;
pub const CBOR_MAJOR_TYPE_ARRAY: u32 = 4;
pub const CBOR_MAJOR_TYPE_MAP: u32 = 5;
pub const CBOR_MAJOR_TYPE_TAGGED: u32 = 6;
pub const CBOR_CBOR_Array_Iterator_Payload_Array: u32 = 0;
pub const CBOR_CBOR_Array_Iterator_Payload_Serialized: u32 = 1;
pub const CBOR_CBOR_Map_Iterator_Payload_Map: u32 = 0;
pub const CBOR_CBOR_Map_Iterator_Payload_Serialized: u32 = 1;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CBOR_cbor_int_s {
    pub cbor_int_type: u8,
    pub cbor_int_value: u64,
}
#[test]
fn bindgen_test_layout_CBOR_cbor_int_s() {
    const UNINIT: ::std::mem::MaybeUninit<CBOR_cbor_int_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CBOR_cbor_int_s>(),
        16usize,
        concat!("Size of: ", stringify!(CBOR_cbor_int_s))
    );
    assert_eq!(
        ::std::mem::align_of::<CBOR_cbor_int_s>(),
        8usize,
        concat!("Alignment of ", stringify!(CBOR_cbor_int_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cbor_int_type) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CBOR_cbor_int_s),
            "::",
            stringify!(cbor_int_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cbor_int_value) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(CBOR_cbor_int_s),
            "::",
            stringify!(cbor_int_value)
        )
    );
}
pub type CBOR_cbor_int = CBOR_cbor_int_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CBOR_cbor_string_s {
    pub cbor_string_type: u8,
    pub cbor_string_length: u64,
    pub cbor_string_payload: *mut u8,
}
#[test]
fn bindgen_test_layout_CBOR_cbor_string_s() {
    const UNINIT: ::std::mem::MaybeUninit<CBOR_cbor_string_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CBOR_cbor_string_s>(),
        24usize,
        concat!("Size of: ", stringify!(CBOR_cbor_string_s))
    );
    assert_eq!(
        ::std::mem::align_of::<CBOR_cbor_string_s>(),
        8usize,
        concat!("Alignment of ", stringify!(CBOR_cbor_string_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cbor_string_type) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CBOR_cbor_string_s),
            "::",
            stringify!(cbor_string_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cbor_string_length) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(CBOR_cbor_string_s),
            "::",
            stringify!(cbor_string_length)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cbor_string_payload) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(CBOR_cbor_string_s),
            "::",
            stringify!(cbor_string_payload)
        )
    );
}
pub type CBOR_cbor_string = CBOR_cbor_string_s;
pub type CBOR_cbor = CBOR_cbor_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CBOR_cbor_tagged0_s {
    pub cbor_tagged0_tag: u64,
    pub cbor_tagged0_payload: *mut CBOR_cbor,
}
#[test]
fn bindgen_test_layout_CBOR_cbor_tagged0_s() {
    const UNINIT: ::std::mem::MaybeUninit<CBOR_cbor_tagged0_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CBOR_cbor_tagged0_s>(),
        16usize,
        concat!("Size of: ", stringify!(CBOR_cbor_tagged0_s))
    );
    assert_eq!(
        ::std::mem::align_of::<CBOR_cbor_tagged0_s>(),
        8usize,
        concat!("Alignment of ", stringify!(CBOR_cbor_tagged0_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cbor_tagged0_tag) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CBOR_cbor_tagged0_s),
            "::",
            stringify!(cbor_tagged0_tag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cbor_tagged0_payload) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(CBOR_cbor_tagged0_s),
            "::",
            stringify!(cbor_tagged0_payload)
        )
    );
}
pub type CBOR_cbor_tagged0 = CBOR_cbor_tagged0_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CBOR_cbor_array_s {
    pub cbor_array_length: u64,
    pub cbor_array_payload: *mut CBOR_cbor,
}
#[test]
fn bindgen_test_layout_CBOR_cbor_array_s() {
    const UNINIT: ::std::mem::MaybeUninit<CBOR_cbor_array_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CBOR_cbor_array_s>(),
        16usize,
        concat!("Size of: ", stringify!(CBOR_cbor_array_s))
    );
    assert_eq!(
        ::std::mem::align_of::<CBOR_cbor_array_s>(),
        8usize,
        concat!("Alignment of ", stringify!(CBOR_cbor_array_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cbor_array_length) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CBOR_cbor_array_s),
            "::",
            stringify!(cbor_array_length)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cbor_array_payload) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(CBOR_cbor_array_s),
            "::",
            stringify!(cbor_array_payload)
        )
    );
}
pub type CBOR_cbor_array = CBOR_cbor_array_s;
pub type CBOR_cbor_map_entry = CBOR_cbor_map_entry_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CBOR_cbor_map_s {
    pub cbor_map_length: u64,
    pub cbor_map_payload: *mut CBOR_cbor_map_entry,
}
#[test]
fn bindgen_test_layout_CBOR_cbor_map_s() {
    const UNINIT: ::std::mem::MaybeUninit<CBOR_cbor_map_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CBOR_cbor_map_s>(),
        16usize,
        concat!("Size of: ", stringify!(CBOR_cbor_map_s))
    );
    assert_eq!(
        ::std::mem::align_of::<CBOR_cbor_map_s>(),
        8usize,
        concat!("Alignment of ", stringify!(CBOR_cbor_map_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cbor_map_length) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CBOR_cbor_map_s),
            "::",
            stringify!(cbor_map_length)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cbor_map_payload) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(CBOR_cbor_map_s),
            "::",
            stringify!(cbor_map_payload)
        )
    );
}
pub type CBOR_cbor_map = CBOR_cbor_map_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CBOR_cbor_serialized_s {
    pub cbor_serialized_size: usize,
    pub cbor_serialized_payload: *mut u8,
}
#[test]
fn bindgen_test_layout_CBOR_cbor_serialized_s() {
    const UNINIT: ::std::mem::MaybeUninit<CBOR_cbor_serialized_s> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CBOR_cbor_serialized_s>(),
        16usize,
        concat!("Size of: ", stringify!(CBOR_cbor_serialized_s))
    );
    assert_eq!(
        ::std::mem::align_of::<CBOR_cbor_serialized_s>(),
        8usize,
        concat!("Alignment of ", stringify!(CBOR_cbor_serialized_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cbor_serialized_size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CBOR_cbor_serialized_s),
            "::",
            stringify!(cbor_serialized_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cbor_serialized_payload) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(CBOR_cbor_serialized_s),
            "::",
            stringify!(cbor_serialized_payload)
        )
    );
}
pub type CBOR_cbor_serialized = CBOR_cbor_serialized_s;
pub type CBOR_cbor_tags = u8;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct CBOR_cbor_s {
    pub tag: CBOR_cbor_tags,
    pub __bindgen_anon_1: CBOR_cbor_s__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union CBOR_cbor_s__bindgen_ty_1 {
    pub case_CBOR_Case_Int64: CBOR_cbor_int,
    pub case_CBOR_Case_String: CBOR_cbor_string,
    pub case_CBOR_Case_Tagged: CBOR_cbor_tagged0,
    pub case_CBOR_Case_Array: CBOR_cbor_array,
    pub case_CBOR_Case_Map: CBOR_cbor_map,
    pub case_CBOR_Case_Simple_value: u8,
    pub case_CBOR_Case_Serialized: CBOR_cbor_serialized,
}
#[test]
fn bindgen_test_layout_CBOR_cbor_s__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<CBOR_cbor_s__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CBOR_cbor_s__bindgen_ty_1>(),
        24usize,
        concat!("Size of: ", stringify!(CBOR_cbor_s__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<CBOR_cbor_s__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(CBOR_cbor_s__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).case_CBOR_Case_Int64) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CBOR_cbor_s__bindgen_ty_1),
            "::",
            stringify!(case_CBOR_Case_Int64)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).case_CBOR_Case_String) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CBOR_cbor_s__bindgen_ty_1),
            "::",
            stringify!(case_CBOR_Case_String)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).case_CBOR_Case_Tagged) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CBOR_cbor_s__bindgen_ty_1),
            "::",
            stringify!(case_CBOR_Case_Tagged)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).case_CBOR_Case_Array) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CBOR_cbor_s__bindgen_ty_1),
            "::",
            stringify!(case_CBOR_Case_Array)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).case_CBOR_Case_Map) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CBOR_cbor_s__bindgen_ty_1),
            "::",
            stringify!(case_CBOR_Case_Map)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).case_CBOR_Case_Simple_value) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CBOR_cbor_s__bindgen_ty_1),
            "::",
            stringify!(case_CBOR_Case_Simple_value)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).case_CBOR_Case_Serialized) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CBOR_cbor_s__bindgen_ty_1),
            "::",
            stringify!(case_CBOR_Case_Serialized)
        )
    );
}
#[test]
fn bindgen_test_layout_CBOR_cbor_s() {
    const UNINIT: ::std::mem::MaybeUninit<CBOR_cbor_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CBOR_cbor_s>(),
        32usize,
        concat!("Size of: ", stringify!(CBOR_cbor_s))
    );
    assert_eq!(
        ::std::mem::align_of::<CBOR_cbor_s>(),
        8usize,
        concat!("Alignment of ", stringify!(CBOR_cbor_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tag) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CBOR_cbor_s),
            "::",
            stringify!(tag)
        )
    );
}
extern "C" {
    pub fn CBOR_cbor_get_major_type(a: CBOR_cbor) -> u8;
}
extern "C" {
    pub fn CBOR_write_cbor(c: CBOR_cbor, out: *mut u8, sz: usize) -> usize;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct CBOR_cbor_map_entry_s {
    pub cbor_map_entry_key: CBOR_cbor,
    pub cbor_map_entry_value: CBOR_cbor,
}
#[test]
fn bindgen_test_layout_CBOR_cbor_map_entry_s() {
    const UNINIT: ::std::mem::MaybeUninit<CBOR_cbor_map_entry_s> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CBOR_cbor_map_entry_s>(),
        64usize,
        concat!("Size of: ", stringify!(CBOR_cbor_map_entry_s))
    );
    assert_eq!(
        ::std::mem::align_of::<CBOR_cbor_map_entry_s>(),
        8usize,
        concat!("Alignment of ", stringify!(CBOR_cbor_map_entry_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cbor_map_entry_key) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CBOR_cbor_map_entry_s),
            "::",
            stringify!(cbor_map_entry_key)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cbor_map_entry_value) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(CBOR_cbor_map_entry_s),
            "::",
            stringify!(cbor_map_entry_value)
        )
    );
}
pub type CBOR_cbor_array_iterator_payload_t_tags = u8;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct CBOR_cbor_array_iterator_payload_t_s {
    pub tag: CBOR_cbor_array_iterator_payload_t_tags,
    pub __bindgen_anon_1: CBOR_cbor_array_iterator_payload_t_s__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union CBOR_cbor_array_iterator_payload_t_s__bindgen_ty_1 {
    pub case_CBOR_Array_Iterator_Payload_Array: *mut CBOR_cbor,
    pub case_CBOR_Array_Iterator_Payload_Serialized: *mut u8,
}
#[test]
fn bindgen_test_layout_CBOR_cbor_array_iterator_payload_t_s__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<CBOR_cbor_array_iterator_payload_t_s__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CBOR_cbor_array_iterator_payload_t_s__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(CBOR_cbor_array_iterator_payload_t_s__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<CBOR_cbor_array_iterator_payload_t_s__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(CBOR_cbor_array_iterator_payload_t_s__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).case_CBOR_Array_Iterator_Payload_Array) as usize
                - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CBOR_cbor_array_iterator_payload_t_s__bindgen_ty_1),
            "::",
            stringify!(case_CBOR_Array_Iterator_Payload_Array)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).case_CBOR_Array_Iterator_Payload_Serialized) as usize
                - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CBOR_cbor_array_iterator_payload_t_s__bindgen_ty_1),
            "::",
            stringify!(case_CBOR_Array_Iterator_Payload_Serialized)
        )
    );
}
#[test]
fn bindgen_test_layout_CBOR_cbor_array_iterator_payload_t_s() {
    const UNINIT: ::std::mem::MaybeUninit<CBOR_cbor_array_iterator_payload_t_s> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CBOR_cbor_array_iterator_payload_t_s>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(CBOR_cbor_array_iterator_payload_t_s)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<CBOR_cbor_array_iterator_payload_t_s>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(CBOR_cbor_array_iterator_payload_t_s)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tag) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CBOR_cbor_array_iterator_payload_t_s),
            "::",
            stringify!(tag)
        )
    );
}
pub type CBOR_cbor_array_iterator_payload_t = CBOR_cbor_array_iterator_payload_t_s;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct CBOR_cbor_array_iterator_t_s {
    pub cbor_array_iterator_length: u64,
    pub cbor_array_iterator_payload: CBOR_cbor_array_iterator_payload_t,
}
#[test]
fn bindgen_test_layout_CBOR_cbor_array_iterator_t_s() {
    const UNINIT: ::std::mem::MaybeUninit<CBOR_cbor_array_iterator_t_s> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CBOR_cbor_array_iterator_t_s>(),
        24usize,
        concat!("Size of: ", stringify!(CBOR_cbor_array_iterator_t_s))
    );
    assert_eq!(
        ::std::mem::align_of::<CBOR_cbor_array_iterator_t_s>(),
        8usize,
        concat!("Alignment of ", stringify!(CBOR_cbor_array_iterator_t_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cbor_array_iterator_length) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CBOR_cbor_array_iterator_t_s),
            "::",
            stringify!(cbor_array_iterator_length)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cbor_array_iterator_payload) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(CBOR_cbor_array_iterator_t_s),
            "::",
            stringify!(cbor_array_iterator_payload)
        )
    );
}
pub type CBOR_cbor_array_iterator_t = CBOR_cbor_array_iterator_t_s;
pub type CBOR_cbor_map_iterator_payload_t_tags = u8;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct CBOR_cbor_map_iterator_payload_t_s {
    pub tag: CBOR_cbor_map_iterator_payload_t_tags,
    pub __bindgen_anon_1: CBOR_cbor_map_iterator_payload_t_s__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union CBOR_cbor_map_iterator_payload_t_s__bindgen_ty_1 {
    pub case_CBOR_Map_Iterator_Payload_Map: *mut CBOR_cbor_map_entry,
    pub case_CBOR_Map_Iterator_Payload_Serialized: *mut u8,
}
#[test]
fn bindgen_test_layout_CBOR_cbor_map_iterator_payload_t_s__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<CBOR_cbor_map_iterator_payload_t_s__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CBOR_cbor_map_iterator_payload_t_s__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(CBOR_cbor_map_iterator_payload_t_s__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<CBOR_cbor_map_iterator_payload_t_s__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(CBOR_cbor_map_iterator_payload_t_s__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).case_CBOR_Map_Iterator_Payload_Map) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CBOR_cbor_map_iterator_payload_t_s__bindgen_ty_1),
            "::",
            stringify!(case_CBOR_Map_Iterator_Payload_Map)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).case_CBOR_Map_Iterator_Payload_Serialized) as usize
                - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CBOR_cbor_map_iterator_payload_t_s__bindgen_ty_1),
            "::",
            stringify!(case_CBOR_Map_Iterator_Payload_Serialized)
        )
    );
}
#[test]
fn bindgen_test_layout_CBOR_cbor_map_iterator_payload_t_s() {
    const UNINIT: ::std::mem::MaybeUninit<CBOR_cbor_map_iterator_payload_t_s> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CBOR_cbor_map_iterator_payload_t_s>(),
        16usize,
        concat!("Size of: ", stringify!(CBOR_cbor_map_iterator_payload_t_s))
    );
    assert_eq!(
        ::std::mem::align_of::<CBOR_cbor_map_iterator_payload_t_s>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(CBOR_cbor_map_iterator_payload_t_s)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tag) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CBOR_cbor_map_iterator_payload_t_s),
            "::",
            stringify!(tag)
        )
    );
}
pub type CBOR_cbor_map_iterator_payload_t = CBOR_cbor_map_iterator_payload_t_s;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct CBOR_cbor_map_iterator_t_s {
    pub cbor_map_iterator_length: u64,
    pub cbor_map_iterator_payload: CBOR_cbor_map_iterator_payload_t,
}
#[test]
fn bindgen_test_layout_CBOR_cbor_map_iterator_t_s() {
    const UNINIT: ::std::mem::MaybeUninit<CBOR_cbor_map_iterator_t_s> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CBOR_cbor_map_iterator_t_s>(),
        24usize,
        concat!("Size of: ", stringify!(CBOR_cbor_map_iterator_t_s))
    );
    assert_eq!(
        ::std::mem::align_of::<CBOR_cbor_map_iterator_t_s>(),
        8usize,
        concat!("Alignment of ", stringify!(CBOR_cbor_map_iterator_t_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cbor_map_iterator_length) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CBOR_cbor_map_iterator_t_s),
            "::",
            stringify!(cbor_map_iterator_length)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cbor_map_iterator_payload) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(CBOR_cbor_map_iterator_t_s),
            "::",
            stringify!(cbor_map_iterator_payload)
        )
    );
}
pub type CBOR_cbor_map_iterator_t = CBOR_cbor_map_iterator_t_s;
extern "C" {
    pub static mut CBOR_dummy_cbor: CBOR_cbor;
}
extern "C" {
    pub fn CBOR_cbor_map_entry_key(uu___: CBOR_cbor_map_entry) -> CBOR_cbor;
}
extern "C" {
    pub fn CBOR_cbor_map_entry_value(uu___: CBOR_cbor_map_entry) -> CBOR_cbor;
}
extern "C" {
    pub fn CBOR_mk_cbor_map_entry(key: CBOR_cbor, value: CBOR_cbor) -> CBOR_cbor_map_entry;
}
extern "C" {
    pub fn CBOR_cbor_compare_aux(c1: CBOR_cbor, c2: CBOR_cbor) -> i16;
}
extern "C" {
    pub fn CBOR_constr_cbor_array(a: *mut CBOR_cbor, len: u64) -> CBOR_cbor;
}
extern "C" {
    pub fn CBOR_cbor_array_length(a: CBOR_cbor) -> u64;
}
extern "C" {
    pub fn CBOR_cbor_array_index(a: CBOR_cbor, i: usize) -> CBOR_cbor;
}
extern "C" {
    pub static mut CBOR_dummy_cbor_array_iterator: CBOR_cbor_array_iterator_t;
}
extern "C" {
    pub fn CBOR_cbor_array_iterator_init(a: CBOR_cbor) -> CBOR_cbor_array_iterator_t;
}
extern "C" {
    pub fn CBOR_cbor_array_iterator_is_done(i: CBOR_cbor_array_iterator_t) -> bool;
}
extern "C" {
    pub fn CBOR_cbor_array_iterator_next(pi: *mut CBOR_cbor_array_iterator_t) -> CBOR_cbor;
}
extern "C" {
    pub fn CBOR_read_cbor_array(a: CBOR_cbor, dest: *mut CBOR_cbor, len: u64) -> *mut CBOR_cbor;
}
extern "C" {
    pub fn CBOR_destr_cbor_string(c: CBOR_cbor) -> CBOR_cbor_string;
}
extern "C" {
    pub fn CBOR_constr_cbor_string(typ: u8, a: *mut u8, len: u64) -> CBOR_cbor;
}
extern "C" {
    pub fn CBOR_destr_cbor_simple_value(c: CBOR_cbor) -> u8;
}
extern "C" {
    pub fn CBOR_constr_cbor_simple_value(value: u8) -> CBOR_cbor;
}
extern "C" {
    pub fn CBOR_destr_cbor_int64(c: CBOR_cbor) -> CBOR_cbor_int;
}
extern "C" {
    pub fn CBOR_constr_cbor_int64(ty: u8, value: u64) -> CBOR_cbor;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct CBOR_cbor_tagged_s {
    pub cbor_tagged_tag: u64,
    pub cbor_tagged_payload: CBOR_cbor,
}
#[test]
fn bindgen_test_layout_CBOR_cbor_tagged_s() {
    const UNINIT: ::std::mem::MaybeUninit<CBOR_cbor_tagged_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CBOR_cbor_tagged_s>(),
        40usize,
        concat!("Size of: ", stringify!(CBOR_cbor_tagged_s))
    );
    assert_eq!(
        ::std::mem::align_of::<CBOR_cbor_tagged_s>(),
        8usize,
        concat!("Alignment of ", stringify!(CBOR_cbor_tagged_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cbor_tagged_tag) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CBOR_cbor_tagged_s),
            "::",
            stringify!(cbor_tagged_tag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cbor_tagged_payload) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(CBOR_cbor_tagged_s),
            "::",
            stringify!(cbor_tagged_payload)
        )
    );
}
pub type CBOR_cbor_tagged = CBOR_cbor_tagged_s;
extern "C" {
    pub fn CBOR_destr_cbor_tagged(a: CBOR_cbor) -> CBOR_cbor_tagged;
}
extern "C" {
    pub fn CBOR_constr_cbor_tagged(tag: u64, a: *mut CBOR_cbor) -> CBOR_cbor;
}
extern "C" {
    pub fn CBOR_cbor_map_length(a: CBOR_cbor) -> u64;
}
extern "C" {
    pub static mut CBOR_dummy_cbor_map_iterator: CBOR_cbor_map_iterator_t;
}
extern "C" {
    pub fn CBOR_constr_cbor_map(a: *mut CBOR_cbor_map_entry, len: u64) -> CBOR_cbor;
}
extern "C" {
    pub fn CBOR_cbor_map_iterator_init(a: CBOR_cbor) -> CBOR_cbor_map_iterator_t;
}
extern "C" {
    pub fn CBOR_cbor_map_iterator_is_done(i: CBOR_cbor_map_iterator_t) -> bool;
}
extern "C" {
    pub fn CBOR_cbor_map_iterator_next(pi: *mut CBOR_cbor_map_iterator_t) -> CBOR_cbor_map_entry;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct CBOR_read_cbor_t_s {
    pub read_cbor_is_success: bool,
    pub read_cbor_payload: CBOR_cbor,
    pub read_cbor_remainder: *mut u8,
    pub read_cbor_remainder_length: usize,
}
#[test]
fn bindgen_test_layout_CBOR_read_cbor_t_s() {
    const UNINIT: ::std::mem::MaybeUninit<CBOR_read_cbor_t_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CBOR_read_cbor_t_s>(),
        56usize,
        concat!("Size of: ", stringify!(CBOR_read_cbor_t_s))
    );
    assert_eq!(
        ::std::mem::align_of::<CBOR_read_cbor_t_s>(),
        8usize,
        concat!("Alignment of ", stringify!(CBOR_read_cbor_t_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).read_cbor_is_success) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CBOR_read_cbor_t_s),
            "::",
            stringify!(read_cbor_is_success)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).read_cbor_payload) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(CBOR_read_cbor_t_s),
            "::",
            stringify!(read_cbor_payload)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).read_cbor_remainder) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(CBOR_read_cbor_t_s),
            "::",
            stringify!(read_cbor_remainder)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).read_cbor_remainder_length) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(CBOR_read_cbor_t_s),
            "::",
            stringify!(read_cbor_remainder_length)
        )
    );
}
pub type CBOR_read_cbor_t = CBOR_read_cbor_t_s;
extern "C" {
    pub fn CBOR_read_cbor(a: *mut u8, sz: usize) -> CBOR_read_cbor_t;
}
extern "C" {
    pub fn CBOR_read_deterministically_encoded_cbor(a: *mut u8, sz: usize) -> CBOR_read_cbor_t;
}
